content/assignments/week6.md
+++
title = "Week 6 - A Compatibilist Kant?"
publishDate = 2020-09-22T00:00:00-04:00
tags = ["action", "agency", "compatibilism", "laws", "principles", "reasoning"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we conclude (at least for the time being) our discussion of Kant on reason
and principles. We then look at the sense in which Kant's source incompatibilism and
its attendant metaphysics might be understood to be an optional or non-essential part
of his overall view concerning rational agency, particularly as that view is
developed by Christine Korsgaard.


## Readings {#readings}

-   Kant:
    -   _Groundwork of the Metaphysics of Morals_: part II, 4:440-45 (PP 89-93); part III,
        4:446-53 (PP 94-100)
    -   _[Review of Schultz](/materials/readings/kant-review-schulz.pdf)_
        -   Read the whole thing, but focus on the argument starting from the first full
            paragraph on 8:13 to the end.
-   Korsgaard,
    -   "[Morality as Freedom](/materials/readings/kosgaard-freedom.pdf)"
    -   "[Creating the Kingdom of Ends](/materials/readings/korsgaard-kingdom.pdf)"
-   Other secondary readings (Optional):

    -   Ameriks, "[Kant and Hegel on Freedom](/materials/readings/ameriks-kant-hegel.pdf)"
        -   Don't worry about the discussion of Hegel, but Ameriks lays out a case for
            thinking that Kant's incompatbilism is purely optional
    -   Kohl, "[Kant on Determinism and the Categorical Imperative](/materials/readings/kohl-determinism.pdf)"
        -   Aims to show how compatibilist readings of Kant are mistaken, and that Kant
            has sound philosophical grounds for advocating his version of incompatibilism

    <!--listend-->

    -   Velleman, "[A Brief Introduction to Kantian Ethics](/materials/readings/velleman-intro-ethics.pdf)"
        -   Very clear and accessable introduction to a broadly "non-metaphysical" and compatibilist
            conception of Kant's position; see especially the section "The Idea of Freedom"
    -   Vilhauer, "[Incompatibilism and Ontological Priority in Kant's Theory of Free Will](/materials/readings/vilhauer-incompatibilism.pdf)"
        -   A case for why Kant has to be an incompatibilist and how his metaphysics
            supports this
    -   Vaida, "[The Problem of Agency and the Problem of Accountability in Kant’s Moral Philosophy](/materials/readings/vaida-agency.pdf)"
        -   Discusses the role of the conception of freedom in Kant's account of rational
            agency and argues that it plays a role only with respect to moral agency, not
            rationality generally
